/**
  ******************************************************************************
  * 
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "strategy.h"

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
__IO MyInfo myInfo = {{0,0}, {0,0}, MyID, 0};
NetInfo netInfo[netInfoSIZE];
__IO u8 netCnt = 0;

/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/
void Leader_Strategy(void) //我是leader，我要启动子网的定位
{
	static u8 Resp_ID[3] = {0, 0, 0};
	//我开始启动广播，在我网络里面的点都要回应，同时记录下我的坐标0,0
	Broadcast_Msg(0xFF, 0, Resp_ID);
	
	if(Resp_ID[0] == 2) //正常来说，我会收到两个人的回应，取最前面那个好了
	{
		//我开始和最近的点测距，同时确定坐标系
		Initiator_Ranging(Resp_ID[1]);
		//我测距的时候，要告诉下一个点主动权交给它啦
	}
}

void Receptor_Strategy(void) //我是监听者，我要继续子网的定位
{
	while(!Receptor_Listening()); //等待接收到消息
	
}
